[Killed] BlockStatement
src/hydration/domain.ts:14:67
  * @param input - Access check input containing record boundaries and viewer context
  * @returns true if the viewer can access the record
  */
-export function canAccessRecord(input: AccessCheckInput): boolean {
-  const { recordBoundaries, ownerDid, context } = input
-
-  // Owner always has access to their own records
-  if (context.viewerDid === ownerDid) {
-    return true
-  }
-
-  // Unauthenticated viewers cannot access private records
-  if (context.viewerDid === null) {
-    return false
-  }
-
-  // Record with no boundaries is accessible to all enrolled users
-  if (recordBoundaries.length === 0) {
-    return true
-  }
-
-  // Check for boundary intersection
-  return hasIntersection(recordBoundaries, context.viewerDomains)
-}
+export function canAccessRecord(input: AccessCheckInput): boolean {}
 
 /**
killedBy: Hydration Domain canAccessRecord should grant access when viewer is the owner
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/hydration/domain.ts:18:7
   const { recordBoundaries, ownerDid, context } = input
 
   // Owner always has access to their own records
-  if (context.viewerDid === ownerDid) {
+  if (context.viewerDid !== ownerDid) {
     return true
   }
killedBy: Hydration Domain canAccessRecord should grant access when viewer is the owner
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hydration/domain.ts:18:39
   const { recordBoundaries, ownerDid, context } = input
 
   // Owner always has access to their own records
-  if (context.viewerDid === ownerDid) {
-    return true
-  }
+  if (context.viewerDid === ownerDid) {}
 
   // Unauthenticated viewers cannot access private records
killedBy: Hydration Domain canAccessRecord should grant access when viewer is the owner
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/hydration/domain.ts:19:12
 
   // Owner always has access to their own records
   if (context.viewerDid === ownerDid) {
-    return true
+    return false
   }
 
killedBy: Hydration Domain canAccessRecord should grant access when viewer is the owner
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hydration/domain.ts:23:7
   }
 
   // Unauthenticated viewers cannot access private records
-  if (context.viewerDid === null) {
+  if (true) {
     return false
   }
killedBy: Hydration Domain canAccessRecord should grant access when record has no boundaries (public to enrolled)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/hydration/domain.ts:23:7
   }
 
   // Unauthenticated viewers cannot access private records
-  if (context.viewerDid === null) {
+  if (context.viewerDid !== null) {
     return false
   }
killedBy: Hydration Domain canAccessRecord should grant access when record has no boundaries (public to enrolled)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/hydration/domain.ts:24:12
 
   // Unauthenticated viewers cannot access private records
   if (context.viewerDid === null) {
-    return false
+    return true
   }
 
killedBy: Hydration Domain canAccessRecord should deny access for unauthenticated viewer
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/hydration/domain.ts:28:7
   }
 
   // Record with no boundaries is accessible to all enrolled users
-  if (recordBoundaries.length === 0) {
+  if (recordBoundaries.length !== 0) {
     return true
   }
killedBy: Hydration Domain canAccessRecord should grant access when record has no boundaries (public to enrolled)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hydration/domain.ts:28:38
   }
 
   // Record with no boundaries is accessible to all enrolled users
-  if (recordBoundaries.length === 0) {
-    return true
-  }
+  if (recordBoundaries.length === 0) {}
 
   // Check for boundary intersection
killedBy: Hydration Domain canAccessRecord should grant access when record has no boundaries (public to enrolled)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/hydration/domain.ts:29:12
 
   // Record with no boundaries is accessible to all enrolled users
   if (recordBoundaries.length === 0) {
-    return true
+    return false
   }
 
killedBy: Hydration Domain canAccessRecord should grant access when record has no boundaries (public to enrolled)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hydration/domain.ts:43:68
  * @param b - Second array
  * @returns true if there is at least one element in common
  */
-export function hasIntersection(a: string[], b: string[]): boolean {
-  const setB = new Set(b)
-  return a.some((item) => setB.has(item))
-}
+export function hasIntersection(a: string[], b: string[]): boolean {}
 
 /**
killedBy: Hydration Domain canAccessRecord should grant access when viewer shares a boundary with record
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
src/hydration/domain.ts:45:17
  */
 export function hasIntersection(a: string[], b: string[]): boolean {
   const setB = new Set(b)
-  return a.some((item) => setB.has(item))
+  return a.some(() => undefined)
 }
 
killedBy: Hydration Domain canAccessRecord should grant access when viewer shares a boundary with record
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/hydration/domain.ts:45:10
  */
 export function hasIntersection(a: string[], b: string[]): boolean {
   const setB = new Set(b)
-  return a.some((item) => setB.has(item))
+  return a.every(item => setB.has(item))
 }
 
killedBy: Hydration Domain canAccessRecord should grant access when viewer shares a boundary with record
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hydration/domain.ts:57:49
  */
 export function filterAccessibleRecords<
   T extends { boundaries: string[]; ownerDid: string },
->(records: T[], context: HydrationContext): T[] {
-  return records.filter((record) =>
-    canAccessRecord({
-      recordBoundaries: record.boundaries,
-      ownerDid: record.ownerDid,
-      context,
-    }),
-  )
-}
+>(records: T[], context: HydrationContext): T[] {}
 
 /**
killedBy: Hydration Domain filterAccessibleRecords should filter records based on viewer access
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
src/hydration/domain.ts:58:25
 export function filterAccessibleRecords<
   T extends { boundaries: string[]; ownerDid: string },
 >(records: T[], context: HydrationContext): T[] {
-  return records.filter((record) =>
-    canAccessRecord({
-      recordBoundaries: record.boundaries,
-      ownerDid: record.ownerDid,
-      context,
-    }),
+  return records.filter(() => undefined,
   )
 }
killedBy: Hydration Domain filterAccessibleRecords should filter records based on viewer access
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
src/hydration/domain.ts:58:10
 export function filterAccessibleRecords<
   T extends { boundaries: string[]; ownerDid: string },
 >(records: T[], context: HydrationContext): T[] {
-  return records.filter((record) =>
-    canAccessRecord({
-      recordBoundaries: record.boundaries,
-      ownerDid: record.ownerDid,
-      context,
-    }),
-  )
+  return records
 }
 
killedBy: Hydration Domain filterAccessibleRecords should filter records based on viewer access
statusReason: expected [ { …(3) }, { …(3) }, { …(3) } ] to have a length of 2 but got 3

[Killed] BlockStatement
src/hydration/domain.ts:73:78
  * @param serviceEndpoint - The service endpoint URL (e.g., "https://stratos.example.com")
  * @returns The service DID in did:web format, or null if invalid
  */
-export function parseServiceEndpoint(serviceEndpoint: string): string | null {
-  try {
-    console.debug(`Parsing service endpoint: ${serviceEndpoint}`)
-    const url = new URL(serviceEndpoint)
-    // Convert hostname to did:web format
-    // e.g., stratos.example.com -> did:web:stratos.example.com
-    return `did:web:${url.hostname}`
-  } catch {
-    return null
-  }
-}
+export function parseServiceEndpoint(serviceEndpoint: string): string | null {}
 
 /**
killedBy: Hydration Domain parseServiceEndpoint should convert https URL to did:web format
statusReason: expected undefined to be 'did:web:stratos.example.com' // Object.is equality

[Killed] BlockStatement
src/hydration/domain.ts:74:7
  * @returns The service DID in did:web format, or null if invalid
  */
 export function parseServiceEndpoint(serviceEndpoint: string): string | null {
-  try {
-    console.debug(`Parsing service endpoint: ${serviceEndpoint}`)
-    const url = new URL(serviceEndpoint)
-    // Convert hostname to did:web format
-    // e.g., stratos.example.com -> did:web:stratos.example.com
-    return `did:web:${url.hostname}`
-  } catch {
+  try {} catch {
     return null
   }
killedBy: Hydration Domain parseServiceEndpoint should convert https URL to did:web format
statusReason: expected undefined to be 'did:web:stratos.example.com' // Object.is equality

[Survived] StringLiteral
src/hydration/domain.ts:75:19
  */
 export function parseServiceEndpoint(serviceEndpoint: string): string | null {
   try {
-    console.debug(`Parsing service endpoint: ${serviceEndpoint}`)
+    console.debug(``)
     const url = new URL(serviceEndpoint)
     // Convert hostname to did:web format

[Killed] BlockStatement
src/hydration/domain.ts:80:11
     // Convert hostname to did:web format
     // e.g., stratos.example.com -> did:web:stratos.example.com
     return `did:web:${url.hostname}`
-  } catch {
-    return null
-  }
+  } catch {}
 }
 
killedBy: Hydration Domain parseServiceEndpoint should return null for invalid URLs
statusReason: expected undefined to be null // Object.is equality

[Killed] BlockStatement
src/hydration/domain.ts:95:12
 export function isLocalService(
   sourceServiceDid: string,
   currentServiceDid: string,
-): boolean {
-  return sourceServiceDid === currentServiceDid
-}
+): boolean {}
 
 /**
killedBy: Hydration Domain isLocalService should return true when service DIDs match
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/hydration/domain.ts:96:10
   sourceServiceDid: string,
   currentServiceDid: string,
 ): boolean {
-  return sourceServiceDid === currentServiceDid
+  return true
 }
 
killedBy: Hydration Domain isLocalService should return false when service DIDs differ
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/hydration/domain.ts:96:10
   sourceServiceDid: string,
   currentServiceDid: string,
 ): boolean {
-  return sourceServiceDid === currentServiceDid
+  return sourceServiceDid !== currentServiceDid
 }
 
killedBy: Hydration Domain isLocalService should return true when service DIDs match
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hydration/domain.ts:111:21
   viewerDid: string | null,
   viewerDomains: string[],
   serviceUrl?: string,
-): HydrationContext {
-  return {
-    viewerDid: viewerDid ?? null,
-    viewerDomains,
-    serviceUrl,
-  }
-}
+): HydrationContext {}
 
 /**
killedBy: Hydration Domain createHydrationContext should create context with viewer info
statusReason: Cannot read properties of undefined (reading 'viewerDid')

[Killed] ObjectLiteral
src/hydration/domain.ts:112:10
   viewerDomains: string[],
   serviceUrl?: string,
 ): HydrationContext {
-  return {
-    viewerDid: viewerDid ?? null,
-    viewerDomains,
-    serviceUrl,
-  }
+  return {}
 }
 
killedBy: Hydration Domain createHydrationContext should create context with viewer info
statusReason: expected undefined to be 'did:plc:viewer123' // Object.is equality

[Killed] LogicalOperator
src/hydration/domain.ts:113:16
   serviceUrl?: string,
 ): HydrationContext {
   return {
-    viewerDid: viewerDid ?? null,
+    viewerDid: viewerDid && null,
     viewerDomains,
     serviceUrl,
killedBy: Hydration Domain createHydrationContext should create context with viewer info
statusReason: expected null to be 'did:plc:viewer123' // Object.is equality

[Killed] ConditionalExpression
src/hydration/domain.ts:132:7
   ownerDid: string,
   serviceUrl: string,
 ): Record<string, unknown> {
-  if ((value as unknown) === null || typeof value !== 'object') {
+  if (true) {
     return value
   }
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] EqualityOperator
src/hydration/domain.ts:132:38
   ownerDid: string,
   serviceUrl: string,
 ): Record<string, unknown> {
-  if ((value as unknown) === null || typeof value !== 'object') {
+  if ((value as unknown) === null || typeof value === 'object') {
     return value
   }
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] ConditionalExpression
src/hydration/domain.ts:138:5
 
   // Check if this is a Stratos post with images embed
   if (
-    value.$type === 'zone.stratos.feed.post' &&
-    value.embed &&
-    typeof value.embed === 'object' &&
-    (value.embed as Record<string, unknown>).$type ===
-      'zone.stratos.embed.images'
+    false
   ) {
     const embed = value.embed as Record<string, unknown>
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] EqualityOperator
src/hydration/domain.ts:138:5
 
   // Check if this is a Stratos post with images embed
   if (
-    value.$type === 'zone.stratos.feed.post' &&
+    value.$type !== 'zone.stratos.feed.post' &&
     value.embed &&
     typeof value.embed === 'object' &&
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] EqualityOperator
src/hydration/domain.ts:140:5
   if (
     value.$type === 'zone.stratos.feed.post' &&
     value.embed &&
-    typeof value.embed === 'object' &&
+    typeof value.embed !== 'object' &&
     (value.embed as Record<string, unknown>).$type ===
       'zone.stratos.embed.images'
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Survived] ConditionalExpression
src/hydration/domain.ts:140:5
   if (
     value.$type === 'zone.stratos.feed.post' &&
     value.embed &&
-    typeof value.embed === 'object' &&
+    true &&
     (value.embed as Record<string, unknown>).$type ===
       'zone.stratos.embed.images'

[Killed] EqualityOperator
src/hydration/domain.ts:141:5
     value.$type === 'zone.stratos.feed.post' &&
     value.embed &&
     typeof value.embed === 'object' &&
-    (value.embed as Record<string, unknown>).$type ===
-      'zone.stratos.embed.images'
+    (value.embed as Record<string, unknown>).$type !== 'zone.stratos.embed.images'
   ) {
     const embed = value.embed as Record<string, unknown>
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Survived] ConditionalExpression
src/hydration/domain.ts:141:5
     value.$type === 'zone.stratos.feed.post' &&
     value.embed &&
     typeof value.embed === 'object' &&
-    (value.embed as Record<string, unknown>).$type ===
-      'zone.stratos.embed.images'
+    true
   ) {
     const embed = value.embed as Record<string, unknown>

[Killed] ConditionalExpression
src/hydration/domain.ts:145:9
       'zone.stratos.embed.images'
   ) {
     const embed = value.embed as Record<string, unknown>
-    if (Array.isArray(embed.images)) {
+    if (false) {
       embed.images = embed.images.map((img: unknown) => {
         if (img && typeof img === 'object') {
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Survived] ConditionalExpression
src/hydration/domain.ts:145:9
       'zone.stratos.embed.images'
   ) {
     const embed = value.embed as Record<string, unknown>
-    if (Array.isArray(embed.images)) {
+    if (true) {
       embed.images = embed.images.map((img: unknown) => {
         if (img && typeof img === 'object') {

[Killed] EqualityOperator
src/hydration/domain.ts:147:20
     const embed = value.embed as Record<string, unknown>
     if (Array.isArray(embed.images)) {
       embed.images = embed.images.map((img: unknown) => {
-        if (img && typeof img === 'object') {
+        if (img && typeof img !== 'object') {
           const imageObj = img as Record<string, unknown>
           if (imageObj.image && typeof imageObj.image === 'object') {
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] ConditionalExpression
src/hydration/domain.ts:147:13
     const embed = value.embed as Record<string, unknown>
     if (Array.isArray(embed.images)) {
       embed.images = embed.images.map((img: unknown) => {
-        if (img && typeof img === 'object') {
+        if (false) {
           const imageObj = img as Record<string, unknown>
           if (imageObj.image && typeof imageObj.image === 'object') {
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] ConditionalExpression
src/hydration/domain.ts:149:15
       embed.images = embed.images.map((img: unknown) => {
         if (img && typeof img === 'object') {
           const imageObj = img as Record<string, unknown>
-          if (imageObj.image && typeof imageObj.image === 'object') {
+          if (false) {
             const blob = imageObj.image as Record<string, unknown>
             if (
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] EqualityOperator
src/hydration/domain.ts:149:33
       embed.images = embed.images.map((img: unknown) => {
         if (img && typeof img === 'object') {
           const imageObj = img as Record<string, unknown>
-          if (imageObj.image && typeof imageObj.image === 'object') {
+          if (imageObj.image && typeof imageObj.image !== 'object') {
             const blob = imageObj.image as Record<string, unknown>
             if (
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] EqualityOperator
src/hydration/domain.ts:152:15
           if (imageObj.image && typeof imageObj.image === 'object') {
             const blob = imageObj.image as Record<string, unknown>
             if (
-              blob.$type === 'blob' &&
+              blob.$type !== 'blob' &&
               blob.ref &&
               typeof blob.ref === 'object'
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] ConditionalExpression
src/hydration/domain.ts:152:15
           if (imageObj.image && typeof imageObj.image === 'object') {
             const blob = imageObj.image as Record<string, unknown>
             if (
-              blob.$type === 'blob' &&
-              blob.ref &&
-              typeof blob.ref === 'object'
+              false
             ) {
               const ref = blob.ref as Record<string, unknown>
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] EqualityOperator
src/hydration/domain.ts:154:15
             if (
               blob.$type === 'blob' &&
               blob.ref &&
-              typeof blob.ref === 'object'
+              typeof blob.ref !== 'object'
             ) {
               const ref = blob.ref as Record<string, unknown>
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Survived] ConditionalExpression
src/hydration/domain.ts:154:15
             if (
               blob.$type === 'blob' &&
               blob.ref &&
-              typeof blob.ref === 'object'
+              true
             ) {
               const ref = blob.ref as Record<string, unknown>

[Killed] BlockStatement
src/hydration/domain.ts:155:15
               blob.$type === 'blob' &&
               blob.ref &&
               typeof blob.ref === 'object'
-            ) {
-              const ref = blob.ref as Record<string, unknown>
-              const cid = ref.$link as string | undefined
-              if (cid) {
-                // Add the hydrated URL
-                // We utilize 'zone.stratos.sync.getBlob'
-                const url = new URL(
-                  `${serviceUrl}/xrpc/zone.stratos.sync.getBlob`,
-                )
-                url.searchParams.set('did', ownerDid)
-                url.searchParams.set('cid', cid)
-                const urlString = url.toString()
-                return {
-                  ...imageObj,
-                  image: {
-                    ...blob,
-                    url: urlString,
-                  },
-                  fullsize: urlString,
-                  thumb: urlString,
-                }
-              }
-            }
+            ) {}
           }
         }
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] ConditionalExpression
src/hydration/domain.ts:158:19
             ) {
               const ref = blob.ref as Record<string, unknown>
               const cid = ref.$link as string | undefined
-              if (cid) {
+              if (false) {
                 // Add the hydrated URL
                 // We utilize 'zone.stratos.sync.getBlob'
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] BlockStatement
src/hydration/domain.ts:158:24
             ) {
               const ref = blob.ref as Record<string, unknown>
               const cid = ref.$link as string | undefined
-              if (cid) {
-                // Add the hydrated URL
-                // We utilize 'zone.stratos.sync.getBlob'
-                const url = new URL(
-                  `${serviceUrl}/xrpc/zone.stratos.sync.getBlob`,
-                )
-                url.searchParams.set('did', ownerDid)
-                url.searchParams.set('cid', cid)
-                const urlString = url.toString()
-                return {
-                  ...imageObj,
-                  image: {
-                    ...blob,
-                    url: urlString,
-                  },
-                  fullsize: urlString,
-                  thumb: urlString,
-                }
-              }
+              if (cid) {}
             }
           }
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: expected undefined to be 'https://stratos.example.com/xrpc/zone…' // Object.is equality

[Killed] ObjectLiteral
src/hydration/domain.ts:167:24
                 url.searchParams.set('did', ownerDid)
                 url.searchParams.set('cid', cid)
                 const urlString = url.toString()
-                return {
-                  ...imageObj,
-                  image: {
-                    ...blob,
-                    url: urlString,
-                  },
-                  fullsize: urlString,
-                  thumb: urlString,
-                }
+                return {}
               }
             }
killedBy: Hydration Domain hydrateRecordBlobs should hydrate blobs in zone.stratos.embed.images
statusReason: Cannot read properties of undefined (reading 'url')
